<?php

declare(strict_types=1);

namespace App\Utils;

/**
 * 个性签名
 * Class UserSign
 * @package Lib
 */
class UserSign
{
    const str=[
        "你知道我深浅,我知道你长短", "睡吗", "别这样", "喝最烈的酒，日最野的狗", "浪够了也别回头，我不等狗",
        "给我一张毛片，我能撬起整个地球", "我能不能肆无忌惮地扑向你的怀抱", "凌晨四点钟，看到海棠花未眠",
        "总之岁月漫长，然而值得等待", "谢谢你来看我", "23x3的秘密，就藏在你身体里", "你别说话了，我想睡了",
        "乖，嘴再张开一点", "以为喜欢你要用心，没想到你喜欢用力", "取悦你的方式有70种，一是shopping，剩下69",
        "春风十里，不如睡你", "大家好 我是不会让你们失望的第十三星座 我是插座", "只想和你用尽千百姿势",
        "用户很懒,什么也没留下","用户很懒,什么也没留下","用户很懒,什么也没留下","用户很懒,什么也没留下","用户很懒,什么也没留下","用户很懒,什么也没留下","用户很懒,什么也没留下","用户很懒,什么也没留下","用户很懒,什么也没留下",
        "看到你，世界诗意了，身体却湿润了",
        "忙归忙，什么时候有空来睡睡我?", "我喜欢干净的你， 但又喜欢把你弄脏", "你可以给我草嘛", "姐姐的腿不是腿 塞纳河畔的春水", "十年如一", "先剥粽子，再划龙舟", "劳动是世界上一切欢乐和美好事情的源泉",
        "one night stand", "雨，都是在没带伞的时候下的", "“蝌蚪”们都牺牲了，青蛙妈妈桑心滴哭了", "婴儿车多贵啊，不合适了", "啪！啪！啪！",
        "“光大”是不行的……", "每五分钟起飞一次", "Just do it!", "今天你戴了没有？", "妈妈我也要",
        "上上下下的快乐！", "你可以再靠近一点！", "生气归生气又不是不喜欢你了", "我好像个泥鳅，为什么啊？因为我超级喜欢泥呀", "住心里的女孩以后也要住家里",
        "我希望压得你喘不过气的不是生活，而是我", "爱你胜于昨日，略匮明朝", "我对世界说晚安，唯独对你说喜欢", "最近有点想你，最远也是",
        "偶尔想你，经常偶尔", "今天吃了一颗很甜的糖，想跟你的舌头分享", "月亮照回湖心，野鹤奔向闲云，我步入你", "我不是来救你的，我是来爱你的",
        "用不着你喜欢也轮不到你讨厌","我有对象了","为什么找个对象这么难","处一周对象啊","一起打游戏不"
    ];

    /**
     * 获取昵称
     * @return string
     */
    public static function getSign()
    {
        return self::str[rand(0,count(self::str)-1)];
    }
}



